Revit 2027 API
OccupancyUnit Enumeration
 An enumerated type listing the occupancy unit of measure for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum OccupancyUnit
Public Enumeration OccupancyUnit
public enum class OccupancyUnit
type OccupancyUnit
Members
Member name | Value | Description
AreaPerPerson | 1 |  OccupancyUnit is AreaPerPerson.
BySpaceType | -1 |  OccupancyUnit is BySpaceType.
NumberOfPeople | 0 |  OccupancyUnit is NumberOfPeople.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace